<?php
// 应用公共文件
function power($role,$per){
    if($role=='0'){
        $permissions=[
            ["用户管理", ['教师管理','学生管理','管理员管理']],
            ["场地管理", ['楼栋管理','实验室管理']],
            ["设备管理", ['添加设备','删除/状态管理']],
            ["预约管理", ['预约信息','预约审核','设备预约','实验室预约']]
        ];
    }
    if($role=='1'){
        $permissions=[
            ["管理员0", ['添加用户1','删除用户1','修改用户1']],
            ["管理员1", ['添加用户2','删除用户','修改用户']],
            ["管理员2", ['添加用户3','删除用户','修改用户']],
            ["管理员3", ['添加用户4','删除用户','修改用户']]
        ];
    }
    if($role=='2'){
        $permissions=[
            ["教师0", ['添加用户1','删除用户1','修改用户1']],
            ["教师1", ['添加用户2','删除用户','修改用户']],
            ["教师2", ['添加用户3','删除用户','修改用户']],
            ["教师3", ['添加用户4','删除用户','修改用户']]
        ];
    }
    if($role=='3'){
        $permissions=[
            ["学生0", ['添加用户1','删除用户1','修改用户1']],
            ["学生1", ['添加用户2','删除用户','修改用户']],
            ["学生2", ['添加用户3','删除用户','修改用户']],
            ["学生3", ['添加用户4','删除用户','修改用户']]
        ];
    }
    return $permissions;
}
